a316363723/pr307-308/pr_307_308_2025_controlbox/HC32F4A0x_usbfs_library/usb_host/host_drv/usb_otg_regs.h
            /** BNA Interrupt mask */
            unsigned bna:1;

            unsigned reserved10_12:3;
            /** BNA Interrupt mask */
            unsigned nak:1;

            unsigned reserved14_31:18;
}stc_bUSB_OTG_DIEPINTn_t;  /* C-STAT */
typedef union _USB_OTG_DIEPINTn_TypeDef
{
    uint32_t d32;
    stc_bUSB_OTG_DIEPINTn_t b;  /* C-STAT */
} USB_OTG_DIEPINTn_TypeDef;

typedef union _USB_OTG_DIEPINTn_TypeDef   USB_OTG_DIEPMSK_TypeDef ;

/* Define bit band for C-STAT */
#define  in_xfercompl         (0x00000001ul)
#define  in_epdisabled        (0x00000002ul)
#define  in_ahberr            (0x00000004ul)
#define  in_timeout           (0x00000008ul)
#define  in_intktxfemp        (0x00000010ul)
#define  in_intknepmis        (0x00000020ul)
#define  in_inepnakeff        (0x00000040ul)
#define  in_emptyintr         (0x00000080ul)
#define  in_txfifoundrn       (0x00000100ul)
#define  in_bna               (0x00000200ul)
#define  in_nak               (0x00002000ul)

#define  out_xfercompl        (0x00000001ul)
#define  out_epdisabled       (0x00000002ul)
#define  out_ahberr           (0x00000004ul)
#define  out_setup            (0x00000008ul)
#define  out_outtknepdis      (0x00000010ul)
#define  out_stsphsercvd      (0x00000020ul)
#define  out_back2backsetup   (0x00000040ul)
#define  out_outpkterr        (0x00000100ul)
#define  out_bna              (0x00000200ul)
#define  out_pktdrpsts        (0x00000800ul)
#define  out_babble           (0x00001000ul)
#define  out_nak              (0x00002000ul)
#define  out_nyet             (0x00004000ul)
#define  out_sr               (0x00008000ul)

typedef struct stc_bUSB_OTG_DOEPINTn
{
            /** Transfer complete */
            unsigned xfercompl:1;
            /** Endpoint disable  */
            unsigned epdisabled:1;
            /** AHB Error */
            unsigned ahberr:1;
            /** Setup Phase Done (contorl EPs) */
            unsigned setup:1;
            /** OUT Token Received when Endpoint Disabled */
            unsigned outtknepdis:1;

            unsigned stsphsercvd:1;
            /** Back-to-Back SETUP Packets Received */
            unsigned back2backsetup:1;

            unsigned reserved7:1;
            /** OUT packet Error */
            unsigned outpkterr:1;
            /** BNA Interrupt */
            unsigned bna:1;

            unsigned reserved10:1;
            /** Packet Drop Status */
            unsigned pktdrpsts:1;
            /** Babble Interrupt */
            unsigned babble:1;
            /** NAK Interrupt */
            unsigned nak:1;
            /** NYET Interrupt */
            unsigned nyet:1;
            /** Bit indicating setup packet received */
            unsigned sr:1;

            unsigned reserved16_31:16;
}stc_bUSB_OTG_DOEPINTn_t;  /* C-STAT */
typedef union _USB_OTG_DOEPINTn_TypeDef
{
    uint32_t d32;
    stc_bUSB_OTG_DOEPINTn_t b;  /* C-STAT */
} USB_OTG_DOEPINTn_TypeDef;

typedef union _USB_OTG_DOEPINTn_TypeDef   USB_OTG_DOEPMSK_TypeDef ;

typedef union _USB_OTG_DAINT_TypeDef
{
    uint32_t d32;
    struct {
        /** IN Endpoint bits */
        unsigned in:16;
        /** OUT Endpoint bits */
        unsigned out:16;
    } ep;
    struct {
        /** IN Endpoint bits */
        unsigned inep0:1;
        unsigned inep1:1;
        unsigned inep2:1;
        unsigned inep3:1;
        unsigned inep4:1;
        unsigned inep5:1;
        unsigned inep6:1;
        unsigned inep7:1;
        unsigned inep8:1;
        unsigned inep9:1;
        unsigned inep10:1;
        unsigned inep11:1;
        unsigned inep12:1;
        unsigned inep13:1;
        unsigned inep14:1;
        unsigned inep15:1;
        /** OUT Endpoint bits */
        unsigned outep0:1;
        unsigned outep1:1;
        unsigned outep2:1;
        unsigned outep3:1;
        unsigned outep4:1;
        unsigned outep5:1;
        unsigned outep6:1;
        unsigned outep7:1;
        unsigned outep8:1;
        unsigned outep9:1;
        unsigned outep10:1;
        unsigned outep11:1;
        unsigned outep12:1;
        unsigned outep13:1;
        unsigned outep14:1;
        unsigned outep15:1;
    } b;
} USB_OTG_DAINT_TypeDef;

typedef union _USB_OTG_DTHRCTL_TypeDef
{
    uint32_t d32;
    struct
    {
        /** non ISO Tx Thr. Enable */
        unsigned non_iso_thr_en:1;
        /** ISO Tx Thr. Enable */
        unsigned iso_thr_en:1;
        /** Tx Thr. Length */
        unsigned tx_thr_len:9;
        /** AHB Threshold ratio */
        unsigned ahb_thr_ratio:2;
        /** Reserved */
        unsigned reserved13_15:3;
        /** Rx Thr. Enable */
        unsigned rx_thr_en:1;
        /** Rx Thr. Length */
        unsigned rx_thr_len:9;
        unsigned reserved26:1;
        /** Arbiter Parking Enable*/
        unsigned arbprken:1;
        /** Reserved */
        unsigned reserved28_31:4;
    }
    b;
} USB_OTG_DTHRCTL_TypeDef;

typedef struct stc_bUSB_OTG_DEPCTL
{
            /** Maximum Packet Size
             * IN/OUT EPn
             * IN/OUT EP0 - 2 bits
             *   2'b00: 64 Bytes
             *   2'b01: 32
             *   2'b10: 16
             *   2'b11: 8 */
            unsigned mps:11;
#define DWC_DEP0CTL_MPS_64   (0u)
#define DWC_DEP0CTL_MPS_32   (1u)
#define DWC_DEP0CTL_MPS_16   (2u)
#define DWC_DEP0CTL_MPS_8    (3u)

            /** Next Endpoint
             * IN EPn/IN EP0
             * OUT EPn/OUT EP0 - reserved */
            unsigned nextep:4;

            /** USB Active Endpoint */
            unsigned usbactep:1;

            /** Endpoint DPID (INTR/Bulk IN and OUT endpoints)
             * This field contains the PID of the packet going to
             * be received or transmitted on this endpoint. The
             * application should program the PID of the first
             * packet going to be received or transmitted on this
             * endpoint , after the endpoint is
             * activated. Application use the SetD1PID and
             * SetD0PID fields of this register to program either
             * D0 or D1 PID.
             *
             * The encoding for this field is
             *   - 0: D0
             *   - 1: D1
             */
            unsigned dpid:1;

            /** NAK Status */
            unsigned naksts:1;

            /** Endpoint Type
             *  2'b00: Control
             *  2'b01: Isochronous
             *  2'b10: Bulk
             *  2'b11: Interrupt */
            unsigned eptype:2;

            /** Snoop Mode
             * OUT EPn/OUT EP0
             * IN EPn/IN EP0 - reserved */
            unsigned snp:1;

