a316363723/pr307-308/pr_307_308_2025_controlbox/HC32F4A0x_usbfs_library/usb_host/host_drv/usb_otg_regs.h
            /** Stall Handshake */
            unsigned stall:1;

            /** Tx Fifo Number
             * IN EPn/IN EP0
             * OUT EPn/OUT EP0 - reserved */
            unsigned txfnum:4;

            /** Clear NAK */
            unsigned cnak:1;
            /** Set NAK */
            unsigned snak:1;
            /** Set DATA0 PID (INTR/Bulk IN and OUT endpoints)
             * Writing to this field sets the Endpoint DPID (DPID)
             * field in this register to DATA0. Set Even
             * (micro)frame (SetEvenFr) (ISO IN and OUT Endpoints)
             * Writing to this field sets the Even/Odd
             * (micro)frame (EO_FrNum) field to even (micro)
             * frame.
             */
            unsigned setd0pid:1;
            /** Set DATA1 PID (INTR/Bulk IN and OUT endpoints)
             * Writing to this field sets the Endpoint DPID (DPID)
             * field in this register to DATA1 Set Odd
             * (micro)frame (SetOddFr) (ISO IN and OUT Endpoints)
             * Writing to this field sets the Even/Odd
             * (micro)frame (EO_FrNum) field to odd (micro) frame.
             */
            unsigned setd1pid:1;

            /** Endpoint Disable */
            unsigned epdis:1;
            /** Endpoint Enable */
            unsigned epena:1;
}stc_bUSB_OTG_DEPCTL_t;  /* C-STAT */
typedef union _USB_OTG_DEPCTL_TypeDef
{
    uint32_t d32;
    stc_bUSB_OTG_DEPCTL_t b;  /* C-STAT */
} USB_OTG_DEPCTL_TypeDef;

typedef struct stc_bUSB_OTG_DEPXFRSIZ
{
            /** Transfer size */
            unsigned xfersize:19;
/** Max packet count for EP (pow(2,10)-1) */
#define MAX_PKT_CNT 1023
            /** Packet Count */
            unsigned pktcnt:10;
            /** Multi Count - Periodic IN endpoints */
            unsigned mc:2;
            unsigned reserved:1;
}stc_bUSB_OTG_DEPXFRSIZ_t;
typedef union _USB_OTG_DEPXFRSIZ_TypeDef
{
    uint32_t d32;
    stc_bUSB_OTG_DEPXFRSIZ_t b;  /* C-STAT */
} USB_OTG_DEPXFRSIZ_TypeDef ;
typedef union _USB_OTG_DEP0XFRSIZ_TypeDef
{
    uint32_t d32;
    struct
    {
        /** Transfer size */
        unsigned xfersize:7;
        /** Reserved */
        unsigned reserved7_18:12;
        /** Packet Count */
        unsigned pktcnt:2;
        /** Reserved */
        unsigned reserved21_28:8;
        /**Setup Packet Count (DOEPTSIZ0 Only) */
        unsigned supcnt:2;
        unsigned reserved31;
    }
    b;
} USB_OTG_DEP0XFRSIZ_TypeDef ;

typedef struct stc_bUSB_OTG_HCFG
{
    uint32_t fslspclksel :
        2;
    uint32_t fslssupp :
        1;
}stc_bUSB_OTG_HCFG_t;   /* C-STAT */
typedef union _USB_OTG_HCFG_TypeDef
{
    uint32_t d32;
    stc_bUSB_OTG_HCFG_t b;  /* C-STAT */
} USB_OTG_HCFG_TypeDef ;

typedef union _USB_OTG_HFRMINTRVL_TypeDef
{
    uint32_t d32;
    struct
    {
        uint32_t frint :
            16;
        uint32_t Reserved :
            16;
    }
    b;
} USB_OTG_HFRMINTRVL_TypeDef ;

typedef union _USB_OTG_HFNUM_TypeDef
{
    uint32_t d32;
    struct
    {
        uint32_t frnum :
            16;
        uint32_t frrem :
            16;
    }
    b;
} USB_OTG_HFNUM_TypeDef ;

typedef struct stc_bUSB_OTG_HPTXSTS
{
    uint32_t ptxfspcavail :
        16;
    uint32_t ptxqspcavail :
        8;
    struct
    {
        uint32_t terminate :
            1;
        uint32_t token :
            2;
        uint32_t chnum :
            4;
        uint32_t odd_even :
            1;
    } ptxqtop;
}stc_bUSB_OTG_HPTXSTS_t;  /* C-STAT */
typedef union _USB_OTG_HPTXSTS_TypeDef
{
    uint32_t d32;
    stc_bUSB_OTG_HPTXSTS_t b;  /* C-STAT */
} USB_OTG_HPTXSTS_TypeDef ;

typedef struct stc_bUSB_OTG_HPRT0
{
    uint32_t prtconnsts :
        1;
    uint32_t prtconndet :
        1;
    uint32_t prtena :
        1;
    uint32_t prtenchng :
        1;
    uint32_t prtovrcurract :
        1;
    uint32_t prtovrcurrchng :
        1;
    uint32_t prtres :
        1;
    uint32_t prtsusp :
        1;
    uint32_t prtrst :
        1;
    uint32_t Reserved9 :
        1;
    uint32_t prtlnsts :
        2;
    uint32_t prtpwr :
        1;
    uint32_t prttstctl :
        4;
    uint32_t prtspd :
        2;
    uint32_t Reserved19_31 :
        13;
}stc_bUSB_OTG_HPRT0_t;   /* C-STAT */
typedef union _USB_OTG_HPRT0_TypeDef
{
    uint32_t d32;
    stc_bUSB_OTG_HPRT0_t b;  /* C-STAT */
} USB_OTG_HPRT0_TypeDef ;

typedef struct stc_bUSB_OTG_HAINT
{
    uint32_t chint :
        16;
    uint32_t Reserved :
        16;
}stc_bUSB_OTG_HAINT_t; /* C-STAT */
typedef union _USB_OTG_HAINT_TypeDef
{
    uint32_t d32;
    stc_bUSB_OTG_HAINT_t b;  /* C-STAT */
} USB_OTG_HAINT_TypeDef ;

typedef union _USB_OTG_HAINTMSK_TypeDef
{
    uint32_t d32;
    struct
    {
        uint32_t chint :
            16;
        uint32_t Reserved :
            16;
    }
    b;
} USB_OTG_HAINTMSK_TypeDef ;

typedef struct stc_bUSB_OTG_HCCHAR
{
    uint32_t mps :
        11;
    uint32_t epnum :
        4;
    uint32_t epdir :
        1;
    uint32_t Reserved :
        1;
    uint32_t lspddev :
        1;
    uint32_t eptype :
        2;
    uint32_t multicnt :
        2;
    uint32_t devaddr :
        7;
    uint32_t oddfrm :
        1;
    uint32_t chdis :
        1;
    uint32_t chen :
        1;
}stc_bUSB_OTG_HCCHAR_t;   /* C-STAT */
typedef union _USB_OTG_HCCHAR_TypeDef
{
    uint32_t d32;
    stc_bUSB_OTG_HCCHAR_t b;  /* C-STAT */
} USB_OTG_HCCHAR_TypeDef ;

typedef union _USB_OTG_HCSPLT_TypeDef
{
    uint32_t d32;
    struct
    {
        uint32_t prtaddr :
            7;
        uint32_t hubaddr :
            7;
        uint32_t xactpos :
            2;
        uint32_t compsplt :
            1;
        uint32_t Reserved :
            14;
        uint32_t spltena :
            1;
    }
    b;
} USB_OTG_HCSPLT_TypeDef ;


/* Bit define for C-STAT */
#define hc_xfercompl    (0x000000001ul)
#define hc_chhltd       (0x000000002ul)
#define hc_ahberr       (0x000000004ul)
#define hc_stall        (0x000000008ul)
#define hc_nak          (0x000000010ul)
#define hc_ack          (0x000000020ul)
#define hc_nyet         (0x000000040ul)
#define hc_xacterr      (0x000000080ul)
#define hc_bblerr       (0x000000100ul)
#define hc_frmovrun     (0x000000200ul)
#define hc_datatglerr   (0x000000400ul)

typedef struct stc_bUSB_OTG_HCINTn
{
    uint32_t xfercompl :
        1;
    uint32_t chhltd :
        1;
    uint32_t ahberr :
        1;
    uint32_t stall :
        1;
    uint32_t nak :
        1;
    uint32_t ack :
        1;
    uint32_t nyet :
        1;
    uint32_t xacterr :
        1;
    uint32_t bblerr :
        1;
    uint32_t frmovrun :
        1;
    uint32_t datatglerr :
        1;
    uint32_t Reserved :
        21;
}stc_bUSB_OTG_HCINTn_t;  /* C-STAT */
typedef union _USB_OTG_HCINTn_TypeDef
{
    uint32_t d32;
    stc_bUSB_OTG_HCINTn_t b; /* C-STAT */
} USB_OTG_HCINTn_TypeDef ;

typedef struct stc_bUSB_OTG_HCTSIZn
{
    uint32_t xfersize :
        19;
    uint32_t pktcnt :
        10;
    uint32_t pid :
        2;
    uint32_t dopng :
        1;
}stc_bUSB_OTG_HCTSIZn_t;   /* C-STAT */
