a316363723/pr307-308/pr_307_308_2025_controlbox/HC32F4A0x_usbfs_library/usb_host/host_drv/usb_otg_regs.h
typedef union _USB_OTG_HCTSIZn_TypeDef
{
    uint32_t d32;
    stc_bUSB_OTG_HCTSIZn_t b; /* C-STAT */
} USB_OTG_HCTSIZn_TypeDef ;

typedef union _USB_OTG_HCINTMSK_TypeDef
{
    uint32_t d32;
    struct
    {
        uint32_t xfercompl :
            1;
        uint32_t chhltd :
            1;
        uint32_t ahberr :
            1;
        uint32_t stall :
            1;
        uint32_t nak :
            1;
        uint32_t ack :
            1;
        uint32_t nyet :
            1;
        uint32_t xacterr :
            1;
        uint32_t bblerr :
            1;
        uint32_t frmovrun :
            1;
        uint32_t datatglerr :
            1;
        uint32_t Reserved :
            21;
    }
    b;
} USB_OTG_HCINTMSK_TypeDef ;

typedef union _USB_OTG_PCGCCTL_TypeDef
{
    uint32_t d32;
    struct
    {
        /** Stop Pclk */
        unsigned stoppclk:1;
        /** Gate Hclk */
        unsigned gatehclk:1;
        /** Power Clamp */
        unsigned pwrclmp:1;
        /** Reset Power Down Modules */
        unsigned rstpdwnmodule:1;
        /** Reserved */
        unsigned reserved:1;
        /** Enable Sleep Clock Gating (Enbl_L1Gating) */
        unsigned enbl_sleep_gating:1;
        /** PHY In Sleep (PhySleep) */
        unsigned phy_in_sleep:1;
        /** Deep Sleep*/
        unsigned deep_sleep:1;
        unsigned resetaftsusp:1;
        unsigned restoremode:1;
        unsigned enbl_extnd_hiber:1;
        unsigned extnd_hiber_pwrclmp:1;
        unsigned extnd_hiber_switch:1;
        unsigned ess_reg_restored:1;
        unsigned prt_clk_sel:2;
        unsigned port_power:1;
        unsigned max_xcvrselect:2;
        unsigned max_termsel:1;
        unsigned mac_dev_addr:7;
        unsigned p2hd_dev_enum_spd:2;
        unsigned p2hd_prt_spd:2;
        unsigned if_dev_mode:1;
    }
    b;
} USB_OTG_PCGCCTL_TypeDef ;

/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/*******************************************************************************
  Global function prototypes (definition in C source)
 ******************************************************************************/

#endif //__USB_OTG_REGS_H__

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/

